app/controllers/profiles_controller.rb

    def index
        render json: Profile.all
---
SELECT "profiles".* FROM "profiles"

    def create
      profile = Profile.create!(profile_params)
---
INSERT INTO "profiles" ("imgUrl", "title", "price", "moverName", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"