app/controllers/requests_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
SELECT "requests".* FROM "requests" WHERE "requests"."user_id" = $1  [["user_id", 28]]
---
    def index
        @current_user = User.find_by(id: session[:user_id])
        requests = @current_user.requests.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
INSERT INTO "requests" ("moving_from", "moving_to", "moving_date", "additional_info", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @current_user = User.find_by(id: session[:user_id])
        request = @current_user.requests.create!(request_params)